content-org/website.org
#+HUGO_BASE_DIR: ~/Documents/almoszediu-website
#+HUGO_FRONT_MATTER_KEY_REPLACE: author>nil

#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
** DONE Our insatiable need to consume content on YouTube :rant:consumerism:
:PROPERTIES:
:EXPORT_FILE_NAME: need-to-feed
:EXPORT_DATE: 2020-05-19
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :featuredImage "/images/watching.jpg"
:END:

Every passing day, this corona thing makes me consume more and more online
content, in order to avoid facing my responsibilites and pass the time somehow.
Our generation (young adults in their late teens, early twenties) praises
itself in avoiding the pitfall of television. We argue, that because we opt
out of the control of a television network, we control the content we watch and
it's not the other way around, which is how the boomers are fooled by their
black boxes. I'd actually argue against this.
*** YouTube is no better than your average cable subscription
Now hear me out. I can't speak for everyone, that is for sure, I'm just talking
about my personal experience, and the things which I have noticed among my
friends.

Most of the time we seek something easy to consume, easy to digest. We aimlessly
wander around the landscape of YouTube, following it's recommendations, watching
our feed be filled with creators about whom we might have forget about who they
actually were, but we subscribed anyways because of one particular video, at the
end of which we were kindly asked to like, subscribe, hit the bell notification,
the usual drill. Isn't this familiar? Isn't this how we... watched TV? Aimless,
zombie like state, when we just want to be entertained, want to avoid our own
thoughts, problems and more. To me, this platform in this regard is not better,
but actually worse. At least, when we were watching TV, we were struck odd by
stupidity of advertisements. Speaking of which...
*** The advent of in-content advertisement. Improvise, adapt, overcome
If you read this blog, you probably know, what AdBlock is. It was born out of a
simple need: purify the web. In the early days, of which I wasn't really that
much a part of (we got internet at my house 2008-ish?), but even at the end of it, the internet was a Wild West. There was little to no corporate interest, just a
bunch of nerds like myself launching their websites, and the tech industry
producing it's first couple of giants, which the world watched with peering
eyes, but weren't of the significance or importance as they are today. It was a
naive and liberating place, not controlled by two or three big companies, like
it is today. Online forums, dozens of proto-social media candidates, sprawling
communities. Even as a child I wandered around the forums of the only MMORPG
that could be played on my Pentium4 computer (Metin2) and made some good friends
on IRC chats.

Everything changed, when the advertisement nations attacked. In the second part
of the 2010-s, YouTube became a sophisticated enough platform for more serious
advertisement. That is good enough for showing advertisement for average or
casual YouTube viewers, but you don't really need a whole lot of tech savvyness
to install an AdBlocker. So channels started to directly work directly with
sponsors, which was and is more profitable for them and more direct and genuine
for the consumer, being a better advertisement platform.

This is both a good thing and a bad thing in my opinion. A good thing in the
sense that a content creator does not rely solely on the mystical YouTube-AI
which deems videos advertiser unfriendly left and right, but a bad thing in the
sense that the same content creator becomes dependent on other, more direct
third parties. This may or may not push them into accepting contracts in which
not the ads are the means of producing videos, by financing this endeavor, but
the videos become the shell to show these ads. This trend is not as strong as it
is in the case of mainstream television, as individuals are harder to corrupt
than established TV-stations.

This shell state however is getting more and more popular because the way to
fame and views (which leads to revenue) is through controversy and clickbait.

*** TOP 10 WAYS I REACT TO WATER BEING WET (NUMBER 7 WILL SHOCK YOU)
We're all way too familiar with this. All caps title, a surprised or curious
face of our content producer and a topic which at the surface level might even
be of interest to us. We click on it, watch the whole ten minute video, which
takes ages to reach to a conclusion, which isn't at all groundbreaking in the
slightest sense. We feel nothing at all. We learned nothing at all. We might
have smiled or even laughed at some jokes, but we weren't even entertained while
watching this thing. There was nothing of particular value put into it, which
couldn't have been said or done by one of our friends next to a beer.

This shallowness might not be intentional at all. But it makes the most sense,
from a content producer's perspective. If you're doing this professionally, and
rely on sponsorships it simply doesn't really make sense to make very long, hard
to produce videos. One off sponsor segments are worth more in high quantity,
shorter videos, than many sponsor segments in a long one.

Long, quality videos take a lot of work, and a lot energy to make. Not only
this, but in order to make it watchable, you have to fill it with audio-visual
stimulants, because we've been spoon-fed with these, just like with sugar. Take
for example the Kurzgesagt channel. It is a truly amazing and noteworthy
channel, but would it be interesting to so many people without it's top notch
animation? What if the audio quality would remain the same, the writing the
same, and only the scope of visual representation would change, without reducing
the amount of information. Would it be as successful, as it is now? And again,
I'm not against these animations, I think they are wonderful, I'm just pointing
out why they're a symptom of our instant gratification filled world.This
is not necessarily only the content producer's fault.

So far I've been pointing at the platform itself along with it's creators, but it would be foolish to
ignore the responsibility of the customer from this whole ordeal.
*** The numbness of the mind
I have noticed on myself, that the year long exposure to instant gratification
web-media has made me... dumber. My reading comprehension hasn't diminished
significantly, but analyzing and understanding highly structural, complex and
self-referencing texts has become harder for me. Another thing which I think was
hurt by today's social media landscape is my ability to pay attention at
university classes. We've been accustomed to getting new types of impulses every
few minutes with a different topic, and getting your brain bombarded with
something substantially new and complex feels dangerous, in a way.

One of my favorite channels is [[https://www.youtube.com/channel/UCSkzHxIcfoEr69MWBdo0ppg][Cuck Philosophy]]. He mostly analyzes twentieth
century philosopher's in a thorough way, outlining their main ideas or
contributions to general philosophic thought but also bringing forth their
cultural significance. As much as I enjoy and like these videos, I often find
myself not being able to reconstruct the train of thought presented to me. He
does not use catchy thumbnails, does not cracks jokes, he makes content for the
sake of content and education. It may also be a factor, that I'm not a philosophy
major, nor am I very educated in this field, but I firmly believe, that had I
continued my habit of reading (literature, and more complex non-fiction books,
not those self-help improvement crapfests [about which I might write an article
in the future]), I'd be more capable of receiving and processing information,
along with a more structural train of thought.

*** Final remarks
Though it may seem weird after the things written above, I truly believe that
YouTube is one of the greatest platform's in existence. I've learned many useful
skills, and encountered knowledge that otherwise might never have reached me.

Ultimately it is our responsibility too as consumers, to be conscious about our time
and attention, and give it to those creations which deserve it. Also, there's
nothing wrong with being lighthearted or watching cat videos, it's just the
amount of those videos that you watch daily, that should be alarming.

I think the best way for monetizing content and appreciating creative work is through
direct crowdfunding. This topic will receive it's own post.

Stay safe and read something cool!



**** Attributions:
 /Thumbnail image: [[https://www.flickr.com/photos/tcee35mm/41454088142][They Are Watching You]], by [[https://www.flickr.com/photos/tcee35mm/][Tee Cee]] [[https://creativecommons.org/licenses/by/2.0/legalcode][(CC BY 2.0)]]/
